stoprocent/arduino-kontakt/nRF51822/arduino/arduino-1.6.x/hardware/Kontakt/Kontakt_nRF51822/boards.txt

##############################################################

Kontakt_nRF51822.name=Smart Beacon 2.4 (Kontakt.io)

Kontakt_nRF51822.upload.tool=openocd
Kontakt_nRF51822.upload.protocol=
Kontakt_nRF51822.upload.maximum_size=262144
Kontakt_nRF51822.upload.maximum_data_size=16384
Kontakt_nRF51822.upload.speed=115200
Kontakt_nRF51822.upload.disable_flushing=false
Kontakt_nRF51822.upload.use_1200bps_touch=false
Kontakt_nRF51822.upload.wait_for_upload_port=false

Kontakt_nRF51822.bootloader.tool=openocd
Kontakt_nRF51822.bootloader.bootloader_file=bootloader.hex

Kontakt_nRF51822.build.mcu=cortex-m0
Kontakt_nRF51822.build.f_cpu=16000000
Kontakt_nRF51822.build.usb_product="Arduino Kontakt"
Kontakt_nRF51822.build.board=Kontakt_nRF51822
Kontakt_nRF51822.build.core=Kontakt_nRF51822
Kontakt_nRF51822.build.variant=BLE_Nano
Kontakt_nRF51822.build.extra_flags=-mthumb
Kontakt_nRF51822.build.ldscript=linker_scripts/gcc/Kontakt_nRF51822.ld
Kontakt_nRF51822.build.ble_api_include="-I{runtime.platform.path}/cores/Kontakt_nRF51822/ble-master" "-I{runtime.platform.path}/cores/Kontakt_nRF51822/ble-master/ble/services" "-I{runtime.platform.path}/cores/Kontakt_nRF51822/ble-master/source" "-I{runtime.platform.path}/cores/Kontakt_nRF51822/ble-master/source/services"
Kontakt_nRF51822.build.nRF51822_api_include="-I{runtime.platform.path}/cores/Kontakt_nRF51822/ble-nrf51822-master/source" "-I{runtime.platform.path}/cores/Kontakt_nRF51822/ble-nrf51822-master/source/btle" "-I{runtime.platform.path}/cores/Kontakt_nRF51822/ble-nrf51822-master/source/btle/custom" "-I{runtime.platform.path}/cores/Kontakt_nRF51822/ble-nrf51822-master/source/common" "-I{runtime.platform.path}/cores/Kontakt_nRF51822/ble-nrf51822-master/source/nordic_sdk/components/ble/ble_radio_notification" "-I{runtime.platform.path}/cores/Kontakt_nRF51822/ble-nrf51822-master/source/nordic_sdk/components/ble/ble_services/ble_dfu" "-I{runtime.platform.path}/cores/Kontakt_nRF51822/ble-nrf51822-master/source/nordic_sdk/components/ble/common" "-I{runtime.platform.path}/cores/Kontakt_nRF51822/ble-nrf51822-master/source/nordic_sdk/components/ble/device_manager" "-I{runtime.platform.path}/cores/Kontakt_nRF51822/ble-nrf51822-master/source/nordic_sdk/components/ble/device_manager/config" "-I{runtime.platform.path}/cores/Kontakt_nRF51822/ble-nrf51822-master/source/nordic_sdk/components/ble/peer_manager" "-I{runtime.platform.path}/cores/Kontakt_nRF51822/ble-nrf51822-master/source/nordic_sdk/components/device" "-I{runtime.platform.path}/cores/Kontakt_nRF51822/ble-nrf51822-master/source/nordic_sdk/components/drivers_nrf/ble_flash" "-I{runtime.platform.path}/cores/Kontakt_nRF51822/ble-nrf51822-master/source/nordic_sdk/components/drivers_nrf/delay" "-I{runtime.platform.path}/cores/Kontakt_nRF51822/ble-nrf51822-master/source/nordic_sdk/components/drivers_nrf/hal" "-I{runtime.platform.path}/cores/Kontakt_nRF51822/ble-nrf51822-master/source/nordic_sdk/components/drivers_nrf/pstorage" "-I{runtime.platform.path}/cores/Kontakt_nRF51822/ble-nrf51822-master/source/nordic_sdk/components/drivers_nrf/pstorage/config" "-I{runtime.platform.path}/cores/Kontakt_nRF51822/ble-nrf51822-master/source/nordic_sdk/components/libraries/bootloader_dfu" "-I{runtime.platform.path}/cores/Kontakt_nRF51822/ble-nrf51822-master/source/nordic_sdk/components/libraries/bootloader_dfu/hci_transport" "-I{runtime.platform.path}/cores/Kontakt_nRF51822/ble-nrf51822-master/source/nordic_sdk/components/libraries/crc16" "-I{runtime.platform.path}/cores/Kontakt_nRF51822/ble-nrf51822-master/source/nordic_sdk/components/libraries/experimental_section_vars" "-I{runtime.platform.path}/cores/Kontakt_nRF51822/ble-nrf51822-master/source/nordic_sdk/components/libraries/fds" "-I{runtime.platform.path}/cores/Kontakt_nRF51822/ble-nrf51822-master/source/nordic_sdk/components/libraries/fstorage" "-I{runtime.platform.path}/cores/Kontakt_nRF51822/ble-nrf51822-master/source/nordic_sdk/components/libraries/hci" "-I{runtime.platform.path}/cores/Kontakt_nRF51822/ble-nrf51822-master/source/nordic_sdk/components/libraries/scheduler" "-I{runtime.platform.path}/cores/Kontakt_nRF51822/ble-nrf51822-master/source/nordic_sdk/components/libraries/timer" "-I{runtime.platform.path}/cores/Kontakt_nRF51822/ble-nrf51822-master/source/nordic_sdk/components/libraries/util" "-I{runtime.platform.path}/cores/Kontakt_nRF51822/ble-nrf51822-master/source/nordic_sdk/components/softdevice/common/softdevice_handler" "-I{runtime.platform.path}/cores/Kontakt_nRF51822/ble-nrf51822-master/source/nordic_sdk/components/softdevice/s130/headers"
Kontakt_nRF51822.build.mbed_api_include="-I{runtime.platform.path}/cores/Kontakt_nRF51822/mbed/api" "-I{runtime.platform.path}/cores/Kontakt_nRF51822/mbed/common" "-I{runtime.platform.path}/cores/Kontakt_nRF51822/mbed/hal" "-I{runtime.platform.path}/cores/Kontakt_nRF51822/mbed/targets/cmsis" "-I{runtime.platform.path}/cores/Kontakt_nRF51822/mbed/targets/cmsis/TARGET_NORDIC/TARGET_MCU_NRF51822/" "-I{runtime.platform.path}/cores/Kontakt_nRF51822/mbed/targets/hal/TARGET_NORDIC/TARGET_MCU_NRF51822" "-I{runtime.platform.path}/cores/Kontakt_nRF51822/mbed/targets/hal/TARGET_NORDIC/TARGET_MCU_NRF51822/TARGET_KONTAKT_NRF51822"

##############################################################
